{"pageProps":{"post":{"content":"<p>In early May, I had a week's holiday and decided to finally build the site I've been telling myself I'll do for the last 6 years.</p>\n<h2>Why?</h2>\n<p><strong>Narcissism.</strong></p>\n<p>Actually, the motivations for building this site are hopefully relatable.</p>\n<p>Working on the same internal copyrighted project for a few years was starting to stifle my experience with other languages, frameworks, build tools, etc. Having recently gone through a round of interviews at various companies, two issues kept cropping up: a lack of TypeScript experience and a lack of publically available code examples.</p>\n<p>So, some basic requirements to attempt to address that. This site should:</p>\n<ul>\n<li>be written in TypeScript</li>\n<li>use some new bootstrap (i.e. not Create React App)</li>\n<li>function as a place to demonstrate <strong>production quality</strong> code</li>\n</ul>\n<p>That last point is probably overkill. I don't know many personal sites with a robust set of unit and end-to-end tests, but that's my intention here.</p>\n<h2>Implementation</h2>\n<p>That brings us on to some implementation decisions.</p>\n<p>In terms of static site generators, there are <a href=\"https://jamstack.org/generators\">quite a few options</a>. However, after deciding to stick with React, it starts to become a bit of a two horse race between <a href=\"https://nextjs.org/\">Next.js</a> and <a href=\"https://www.gatsbyjs.com/\">Gatsby</a>.</p>\n<p>I ended up choosing Next.js, primarily because of it's flexibility. Whilst Gatsby is designed purely as a static site generator, the main focus of Next.js is server side rendering. It just so happens to <em>also</em> offer static site generation.</p>\n<figure>\n  <img src='/assets/blog/building-this-site/peopleUsingNext.png' alt=\"Companies using Next.js\"/>\n  <figcaption>Lots of companies are starting to adopt Next.js</figcaption>\n</figure>\n<p>So if this site ever evolves to the point where it needs a dynamic backend, it can! At the same time, I also gain experience with a framework that <a href=\"https://nextjs.org/showcase\">a lot of companies are now using.</a> Win-win.</p>\n","coverImage":"/assets/blog/building-this-site/code.png","date":"2021-05-09T15:40:07.322Z","excerpt":"My motivations for building a personal site, and some lessons learned along the way.","slug":"building-this-site","title":"Building this site"}},"__N_SSG":true}