{"pageProps":{"post":{"content":"<p>In early May, I had a week's holiday and decided to finally build the site I've been telling myself I'll do for the last 6 years.</p>\n<h2>Why?</h2>\n<p><strong>Narcissism.</strong></p>\n<p>Actually, the motivations for building this site are hopefully relatable.</p>\n<p>Working on the same internal copyrighted project for a few years was starting to stifle my experience with other languages, frameworks, build tools, etc. Having recently gone through a round of interviews at various companies, two issues kept cropping up: a lack of TypeScript experience and a lack of publically available code examples.</p>\n<p>So, some basic requirements to attempt to address that. This site should:</p>\n<ul>\n<li>be written in TypeScript</li>\n<li>use some new bootstrap (i.e. not Create React App)</li>\n<li>should have a mobile first design</li>\n<li>function as a place to demonstrate <strong>production quality</strong> code</li>\n</ul>\n<p>I'll probably regret that last point.</p>\n<h2>Implementation</h2>\n<p>As with most blogs or portfolio sites, there isn't really a need for a backend server to be running to dynamically generate pages. The content lends itself to being statically generated.</p>\n<p>This has a couple of advantages:</p>\n<ol>\n<li>It's <strong>fast</strong>. Being statically generated means that all we're serving up to the end user is the exact same chunk of html and javascript every time. This allows for improved caching, and faster load times as a result.</li>\n<li>It's <strong>cheap</strong>. Not having to run a backend server reduces costs dramatically. This site is currently hosted using <a href=\"https://pages.github.com/\">GitHub Pages</a> for free.</li>\n</ol>\n<p>In terms of static site generators, there are <a href=\"https://jamstack.org/generators\">quite a few options</a>. However, after deciding to stick with React, it starts to become a bit of a two horse race between <a href=\"https://nextjs.org/\">Next.js</a> and <a href=\"https://www.gatsbyjs.com/\">Gatsby</a>.</p>\n<p>I ended up choosing Next.js, primarily because of it's flexibility. Whilst Gatsby is designed purely as a static site generator, the main focus of Next.js is server side rendering. It just so happens to <em>also</em> offer static site generation.</p>\n<figure>\n  <img src='/assets/blog/building-this-site/people-using-next.png' alt=\"Lots of companies are starting to adopt Next.js\"/>\n  <figcaption>Lots of companies are starting to adopt Next.js</figcaption>\n</figure>\n<p>So if this site ever evolves to the point where it needs a dynamic backend, it can! At the same time, I also gain experience with a framework that a lot of companies are now using. Win-win.</p>\n<h2>Design</h2>\n<p>Didn't have one.</p>\n<p>This will probably come as no surprise to anyone, but I'm not a designer. I ended up playing around with most things in the browser until I was happy. The optimal solution is probably to use wireframes up front.</p>\n<p>The only thing I'm not quite happy with is the card design for each post. But that's ok - it's good enough for now, and I'm sure it'll be tweaked in the future.</p>\n<figure>\n  <img src='/assets/blog/building-this-site/card-design.png' alt=\"The current card design.\"/>\n  <figcaption>The current card design.</figcaption>\n</figure>\n<h2>Colours</h2>\n<p>One thing I wanted for the site was a theme toggle or dark mode toggle. There are <a href=\"https://blog.weekdone.com/why-you-should-switch-on-dark-mode/\">various benefits</a> to this, but I find the biggest one is that it forces you to pare back and structure your styles properly. Simplicity is key. A few different background shades, a couple of choices for text, a splash of colour for interactive elements, etc.</p>\n<p>What I've ended up with is a <code>globals.scss</code> file at the root of the project that looks something like:</p>\n<pre><code class=\"language-scss\">:root[data-theme='light'] {\n  --background: #fff;\n  --border: #e0e0e0;\n  --card-brightness: 5;\n  --container: #f4f4f4;\n  --container-alt: #a8a8a8;\n  --container--rgb: 244, 244, 244;\n  --interactive: #0f9bfe;\n  --hero-background-rgb: 0, 0, 0;\n  --hero-text-primary: #fff;\n  --icon-primary: #000;\n  --icon-secondary: #525252;\n  --logo-durham-primary: #002337;\n  --logo-durham-secondary: #702567;\n  --logo-ibm: #1f70c1;\n  --logo-qinetiq: #002744;\n  --text-primary: #000;\n  --text-secondary: #525252;\n}\n\n:root[data-theme='dark'] {\n  --background: #262626;\n  --border: #525252;\n  --card-brightness: 0.6;\n  --container: #393939;\n  --container-alt: #6f6f6f;\n  --container--rgb: 57, 57, 57;\n  --interactive: #60bdff;\n  --hero-background-rgb: 244, 244, 244;\n  --hero-text-primary: #262626;\n  --icon-primary: #f4f4f4;\n  --icon-secondary: #c6c6c6;\n  --logo-durham-primary: #f4f4f4;\n  --logo-durham-secondary: #f4f4f4;\n  --logo-ibm: #1f70c1;\n  --logo-qinetiq: #f4f4f4;\n  --text-primary: #f4f4f4;\n  --text-secondary: #c6c6c6;\n}\n</code></pre>\n<p>This is nice as it makes changes to the theme extremely easy. In less than a minute I can change the site from a fairly muted modern colour palette to a kaleidoscopic nightmare.</p>\n<figure>\n  <img src='/assets/blog/building-this-site/kaleidoscopic-nightmare.png' alt=\"A kaleidoscopic nightmare.\"/>\n  <figcaption>A kaleidoscopic nightmare.</figcaption>\n</figure>\n<p>Originally I was intending to use a CSS-in-JS library, something like <a href=\"https://styled-components.com/\">styled components</a> or <a href=\"https://emotion.sh/docs/introduction\">Emotion</a>. But Next.js <a href=\"https://nextjs.org/docs/basic-features/built-in-css-support#adding-component-level-css\">supports css modules</a> out of the box, so I've stuck with that and been pleasantly suprised.</p>\n<h2>Next steps</h2>\n<p>There's a few things I haven't gotten to yet.</p>\n<p>Firstly, testing. Turns out it's very easy to postpone testing when there's no real requirement and only one person working on the code. Who knew?</p>\n<figure>\n  <img src='/assets/blog/building-this-site/no-tests.png' alt=\"Whoops!\"/>\n  <figcaption>Whoops!</figcaption>\n</figure>\n<p>Nevertheless, I'm still committed to adding tests. In the real world, good tests are one of the most important aspects of a project. I'm also going to use it as an opportunity to experiment with some more new frameworks I haven't had chance to use yet, e.g. <a href=\"https://playwright.dev/\">Playwright</a> instead of <a href=\"https://www.cypress.io/\">Cypress</a>.</p>\n<p>Secondly, performance and SEO. Given how lightweight the site currently is, I don't foresee many problems. But it's just an excuse to play around with <a href=\"https://developers.google.com/web/tools/lighthouse\">Lighthouse</a> a bit more.</p>\n<p>And finally, grab myself a nice domain to host it on! Although that might mean <a href=\"https://domains.google.com/registrar/search?searchTerm=ash&#x26;tab=1\">a lot of searching</a>.</p>\n<h2>Code</h2>\n<p>If you're curious about anything, feel free to check it all out on <a href=\"https://github.com/ashharrison90/ashharrison90.github.io\">GitHub</a>.</p>\n","coverImage":"/assets/blog/building-this-site/code.png","date":"2021-05-09T15:40:07.322Z","excerpt":"My motivations for building a personal site, and some lessons learned along the way.","slug":"building-this-site","title":"Building this site"}},"__N_SSG":true}