{"pageProps":{"post":{"content":"<h2>What is Lighthouse?</h2>\n<blockquote>\n<p>Lighthouse analyzes web apps and web pages, collecting modern performance metrics and insights on developer best practices.</p>\n</blockquote>\n<p>This is the description over on <a href=\"https://github.com/GoogleChrome/lighthouse#readme\">their README</a>. Unpicking that a bit; Lighthouse is a tool developed by Google which monitors a page as it renders and calculates scores for various categories such as <strong>performance</strong>, <strong>accessibility</strong>, and <strong>SEO</strong>.</p>\n<p>If you're reading this in Chrome, you can run Lighthouse right now in the browser. Right click -> <code>Inspect</code> anywhere on the page to open the developer tools, and open the <code>Lighthouse</code> tab.</p>\n<figure>\n  <img src='/assets/blog/lighthouse/chrome-dev-tools.webp' alt=\"How to find Lighthouse in the Chrome dev tools.\"/>\n  <figcaption>How to find Lighthouse in the Chrome dev tools.</figcaption>\n</figure>\n<p>Here you'll be able to generate a Lighthouse report against any site you like.</p>\n<p>How the scores are calculated and weighted could be the topic of a whole article in itself. In short, scores are out of 100 and higher is better. If you're interested, you can read more about how the performance score is calculated <a href=\"https://web.dev/performance-scoring/\">here</a>. They also include <a href=\"https://googlechrome.github.io/lighthouse/scorecalc/\">this handy calculator</a> to see how improvements to various metrics can affect your overall score.</p>\n<h2>So what?</h2>\n<p>So why should we care? Well, these metrics are intended to evaluate how well your site performs for everyone.</p>\n<p>Let's use an example. If your site isn't properly accessible, you could be excluding the <a href=\"https://nfb.org/resources/blindness-statistics\">2.4% of your audience with visual disabilities</a>. And when your potential audience is the entire online population, that is <del>a metric fuckton</del> <ins>nearly 112 million people</ins>.</p>\n<p>If that's not enough, here's another important factor: Google performs similar audits and <a href=\"https://www.google.com/intl/en_uk/search/howsearchworks/algorithms/\">uses this information when deciding how to rank search results</a>. If you want your site to be at the top of Google, focus on making it useful, performant and accessible for everyone first.</p>\n<h2>Running an initial scan</h2>\n<p>So this all <em>sounds</em> great, but there's no way I'm relying on a manual process of running a scan and analysing the results each time. Well, Google provides some tools to run Lighthouse programmatically: <a href=\"https://github.com/GoogleChrome/lighthouse-ci\">Lighthouse CI</a>.</p>\n<p>To get started, I followed <a href=\"https://web.dev/lighthouse-ci/\">this excellent tutorial</a> over on web.dev. This allowed me to set up:</p>\n<ul>\n<li>An npm script to run Lighthouse against my site on my machine.</li>\n<li>A GitHub action to run Lighthouse as part of the existing testing on commits/pull requests.</li>\n<li>Automatic pushing of the final report to temporary public storage</li>\n</ul>\n<p>And within half an hour or so, I had my first automated result:</p>\n<figure>\n  <img src='/assets/blog/lighthouse/first-run.webp' alt=\"First Lighthouse run results\"/>\n  <figcaption>Results of the first Lighthouse scan.</figcaption>\n</figure>\n<p>Not bad. But I couldn't help but be slightly disappointed with such a low performance score given the lightweight nature of the site. We'll come back to that later...</p>\n<h2>Fixing!</h2>\n<p>Step 1 - tackle the low hanging fruit:</p>\n<ul>\n<li><a href=\"https://web.dev/html-has-lang/\"><code>&#x3C;html></code> element does not have a <code>[lang]</code> attribute</a></li>\n<li><a href=\"https://web.dev/external-anchors-use-rel-noopener/\">Links to cross-origin destinations are unsafe</a></li>\n<li><a href=\"https://web.dev/link-text/\">Links do not have descriptive text</a></li>\n<li><a href=\"https://web.dev/uses-webp-images/\">Serve images in modern formats</a></li>\n</ul>\n<p>There's not too much to say about these. I was most surprised by the savings gained from switching to use <code>.webp</code> images instead of <code>.png</code>. <code>.webp</code> is now <a href=\"https://caniuse.com/webp\">supported in all major browsers</a> (friendly reminder that IE is not major anymore...) and <a href=\"https://insanelab.com/blog/web-development/webp-web-design-vs-jpeg-gif-png/\">saves around 26% of the file size</a>. I can't really find a downside other than the slight annoyance of having to run any screen captures through a conversion tool.</p>\n<p>Step 2 - spend ages trying to fix the last remaining performance problem only to eventually give up.</p>\n<p>Remember our low performance score from earlier? It's actually being caused by an extremely high <a href=\"https://web.dev/lcp/\">largest contentful paint</a> time of 7.6s. Largest contentful paint is supposed to measure the time at which the largest element containing content renders. This should include images. However, for some reason, on my site, it's not.</p>\n<figure>\n  <img src='/assets/blog/lighthouse/largest-contentful-paint.webp' alt=\"The largest contentful paint element.\"/>\n  <figcaption>No. Bad Lighthouse.</figcaption>\n</figure>\n<p>Instead it thinks the heading is the LCP element. So it waits whilst it painstakingly types out all the characters of <code>hi i'm ash</code>. Replacing this with plain text gives me a performance score of 100. That's also a bit of a false result, because it still thinks the LCP element is the heading.</p>\n<p>I will eventually figure out how to make it recognise the images. I suspect it's something to do with the parallax container they're housed in, or the fact they're positioned absolutely. But for now, I've given up.</p>\n<p>And so, our final results:</p>\n<figure>\n  <img src='/assets/blog/lighthouse/final-results.webp' alt=\"Final Lighthouse run results.\"/>\n  <figcaption>The final result. For now.</figcaption>\n</figure>\n<p>You may notice the performance score has actually gone down even more. That's because I <a href=\"https://github.com/ashharrison90/ashharrison90.github.io/commit/3d6b0b7b44f652fb25f7b7c772d55ddf1f52a359\">switched to using a library called <code>typewriter-effect</code> to achieve the typewriter animation on the home page</a>. It intentionally completes the animation slightly slower than before, which causes Lighthouse to return a lower score.</p>\n<h2>Preventing regressions with presets</h2>\n<p>Over in the README for Lighthouse CI there's a section on <a href=\"https://github.com/GoogleChrome/lighthouse-ci/blob/main/docs/configuration.md#next-level\">next steps</a>. Here it advocates using the <code>lighthouse:recommended</code> preset. This sets up a bunch of assertions on the collected metrics and fails the run if they dip below a certain threshold.</p>\n<p>There's 2 things to note:</p>\n<ul>\n<li>You can disable individual rules with something like this in your config file:</li>\n</ul>\n<pre><code class=\"language-json\">{\n  \"ci\": {\n    \"assert\": {\n      \"preset\": \"lighthouse:recommended\",\n      \"assertions\": {\n        \"uses-webp-images\": \"off\"\n      }\n    }\n    ...\n  }\n}\n</code></pre>\n<ul>\n<li>I would actually recommend using the <code>lighthouse:no-pwa</code> preset instead. This has all the recommended settings, but without the progressive web app section which can be <a href=\"https://github.com/GoogleChrome/lighthouse-ci/issues/51\">a little strict</a>.</li>\n</ul>\n<h2>Final thoughts</h2>\n<p>Lighthouse is a good start for maintaining a baseline level of performance and accessibility, but it's not a complete solution and it definitely has its faults.</p>\n","coverImage":"/assets/blog/lighthouse/lighthouse.webp","date":"2021-07-11T17:40:07.322Z","excerpt":"How to improve your site for everyone using Lighthouse CI reports.","slug":"lighthouse","tags":["lighthouse","accessibility","seo","performance"],"title":"Lighthouse"}},"__N_SSG":true}